IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G0_EPWM24_CONTROLSS_G0_EPWM24.xml
	<register id="CONTROLSS_G0_EPWM24_TBPHS" acronym="CONTROLSS_G0_EPWM24_TBPHS" offset="0xC0" width="32" description="Time Base Phase High">
		<bitfield id="TBPHS" width="16" begin="31" end="16" resetval="0x0" description="Phase Offset Register  These bits set time-base counter phase of the selected ePWM relative to the time-base that is supplying the synchronization input signal.  - If TBCTL[PHSEN] = 0, then the synchronization event is ignored and the time-base counter is not loaded with the phase. - If TBCTL[PHSEN] = 1, then the time-base counter [TBCTR] will be loaded with the phase [TBPHS] when a synchronization event occurs. The synchronization event can be initiated by the input synchronization signal [EPWMxSYNCI] or by a software forced synchronization." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="TBPHSHR" width="16" begin="15" end="0" resetval="0x0" description="Phase Offset [High Resolution] Register. TBPHSHR must not be used. Instead TRREM [HRPWM remainder register] must be used to mimic the functionality of TBPHSHR.   The lower 8 bits in this register are ignored - writes are ignored and reads return zero" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM24_TBPRDHR" acronym="CONTROLSS_G0_EPWM24_TBPRDHR" offset="0xC4" width="16" description="Time Base Period High Resolution Register ">
		<bitfield id="TBPRDHR" width="16" begin="15" end="0" resetval="0x0" description="Period High Resolution Bits  The upper 8-bits contain the high-resolution portion of the period value. The TBPRDHR register is not affected by the TBCTL[PRDLD] bit. Reads from this register always reflect the shadow register. Likewise writes are also to the shadow register. The TBPRDHR register is only used when the high resolution period feature is enabled. This register is only available with ePWM modules which support high-resolution period control.  The lower 8 bits in this register are ignored - writes are ignored and reads return zero" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM24_TBPRD" acronym="CONTROLSS_G0_EPWM24_TBPRD" offset="0xC6" width="16" description="Time Base Period Register ">
		<bitfield id="TBPRD" width="16" begin="15" end="0" resetval="0x0" description="Time Base Period Register  These bits determine the period of the time-base counter. This sets the PWM frequency. Shadowing of this register is enabled and disabled by the TBCTL[PRDLD] bit. By default this register is shadowed. - If TBCTL[PRDLD] = 0, then the shadow is enabled and any write or read will automatically go to the shadow register. In this case, the active register will be loaded from the shadow register when the time-base counter equals zero. - If TBCTL[PRDLD] = 1, then the shadow is disabled and any write or read will go directly to the active register, that is the register actively controlling the hardware. - The active and shadow registers share the same memory map address." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM24_TBPRDHRB" acronym="CONTROLSS_G0_EPWM24_TBPRDHRB" offset="0xC8" width="16" description="Calculation Result for EPWMxB">
		<bitfield id="TBPRDHRB" width="8" begin="15" end="8" resetval="0x0" description="TBPRD High Resolution Calculation [2] Results for EPWMxB HRPWM Equations" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="TBPRDHRB_DELAY" width="8" begin="7" end="0" resetval="0x0" description="TBPRDHRB Delay" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM24_CMPA" acronym="CONTROLSS_G0_EPWM24_CMPA" offset="0xD4" width="32" description="Counter Compare A Register ">
		<bitfield id="CMPA" width="16" begin="31" end="16" resetval="0x0" description="Compare A Register  The value in the active CMPA register is continuously compared to the time-base counter [TBCTR]. When the values are equal, the counter-compare module generates a time-base counter equal to counter compare A event. This event is sent to the action-qualifier where it is qualified and converted it into one or more actions. These actions can be applied to either the EPWMxA or the EPWMxB output depending on the configuration of the AQCTLA and AQCTLB registers. The actions that can be defined in the AQCTLA and AQCTLB registers include:  - Do nothing  the event is ignored. - Clear: Pull the EPWMxA and/or EPWMxB signal low - Set: Pull the EPWMxA and/or EPWMxB signal high - Toggle the EPWMxA and/or EPWMxB signal  Shadowing of this register is enabled and disabled by the CMPCTL[SHDWAMODE] bit. By default this register is shadowed. - If CMPCTL[SHDWAMODE] = 0, then the shadow is enabled and any write or read will automatically go to the shadow register. In this case, the CMPCTL[LOADAMODE] bit field determines which event will load the active register from the shadow register. - Before a write, the CMPCTL[SHDWAFULL] bit can be read to determine if the shadow register is currently full. - If CMPCTL[SHDWAMODE] = 1, then the shadow register is disabled and any write or read will go directly to the active register, that is the register actively controlling the hardware. - In either mode, the active and shadow registers share the same memory map address." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="CMPAHR" width="16" begin="15" end="0" resetval="0x0" description="Compare A HRPWM Extension Register  The UPPER 8-bits contain the high-resolution portion [most significant 8-bits] of the counter-compare A value. CMPA:CMPAHR can be accessed in a single 32-bit read/write. Shadowing is enabled and disabled by the CMPCTL[SHDWAMODE] bit as described for the CMPA register.  The lower 8 bits in this register are ignored" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM24_CMPB" acronym="CONTROLSS_G0_EPWM24_CMPB" offset="0xD8" width="32" description="Compare B Register ">
		<bitfield id="CMPB" width="16" begin="31" end="16" resetval="0x0" description="Compare B Register  The value in the active CMPB register is continuously compared to the time-base counter [TBCTR]. When the values are equal, the counter-compare module generates a time-base counter equal to counter compare B event. This event is sent to the action-qualifier where it is qualified and converted it into one or more actions. These actions can be applied to either the EPWMxA or the EPWMxB output depending on the configuration of the AQCTLA and AQCTLB registers. The actions that can be defined in the AQCTLA and AQCTLB registers include:  - Do nothing  the event is ignored. - Clear: Pull the EPWMxA and/or EPWMxB signal low - Set: Pull the EPWMxA and/or EPWMxB signal high - Toggle the EPWMxA and/or EPWMxB signal  Shadowing of this register is enabled and disabled by the CMPCTL[SHDWBMODE] bit. By default this register is shadowed. - If CMPCTL[SHDWBMODE] = 0, then the shadow is enabled and any write or read will automatically go to the shadow register. In this case, the CMPCTL[LOADBMODE] bit field determines which event will load the active register from the shadow register. - Before a write, the CMPCTL[SHDWBFULL] bit can be read to determine if the shadow register is currently full. - If CMPCTL[SHDWBMODE] = 1, then the shadow register is disabled and any write or read will go directly to the active register, that is the register actively controlling the hardware. - In either mode, the active and shadow registers share the same memory map address." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="CMPBHR" width="16" begin="15" end="0" resetval="0x0" description="Compare B High Resolution Bits  The lower 8 bits in this register are ignored" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM24_CMPC" acronym="CONTROLSS_G0_EPWM24_CMPC" offset="0xDE" width="16" description="Counter Compare C Register [[br]] [[br]]LINK feature access should always be 16-bit">
		<bitfield id="CMPC" width="16" begin="15" end="0" resetval="0x0" description="Compare C Register  The value in the active CMPC register is continuously compared to the time-base counter [TBCTR]. When the values are equal, the counter-compare module generates a time-base counter equal to counter compare C event.  Shadowing of this register is enabled and disabled by the CMPCTL2[SHDWCMODE] bit. By default this register is shadowed. - If CMPCTL2[SHDWCMODE] = 0, then the shadow is enabled and any write or read will automatically go to the shadow register. In this case, the CMPCTL2[LOADCMODE] bit field determines which event will load the active register from the shadow register: - If CMPCTL2[SHDWCMODE] = 1, then the shadow register is disabled and any write or read will go directly to the active register  that is, the register actively controlling the hardware. - In either mode, the active and shadow registers share the same memory map address." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM24_CMPD" acronym="CONTROLSS_G0_EPWM24_CMPD" offset="0xE2" width="16" description="Counter Compare D Register [[br]] [[br]]LINK feature access should always be 16-bit">
		<bitfield id="CMPD" width="16" begin="15" end="0" resetval="0x0" description="Compare D Register  The value in the active CMPD register is continuously compared to the time-base counter [TBCTR]. When the values are equal, the counter-compare module generates a time-base counter equal to counter compare D event.  Shadowing of this register is enabled and disabled by the CMPCTL2[SHDWDMODE] bit. By default this register is shadowed. - If CMPCTL2[SHDWDMODE] = 0, then the shadow is enabled and any write or read will automatically go to the shadow register. In this case, the CMPCTL2[LOADDMODE] bit field determines which event will load the active register from the shadow register: - If CMPCTL2[SHDWDMODE] = 1, then the shadow register is disabled and any write or read will go directly to the active register  that is, the register actively controlling the hardware. - In either mode, the active and shadow registers share the same memory map address." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM24_GLDCTL2" acronym="CONTROLSS_G0_EPWM24_GLDCTL2" offset="0xE8" width="16" description="Global PWM Load Control Register 2">
		<bitfield id="GFRCLD" width="1" begin="1" end="1" resetval="0x0" description="Force Load Event in One Shot Mode   0: Writing of 0 will be ignored. Always reads back a 0.  1: Force one load event at the input of the event pre-scale counter as shown in the diagram below. This bit is intended to be used for testing and/or software force loading of the events in global load mode." range="1" rwaccess="R/W1TS"/> 
		<bitfield id="OSHTLD" width="1" begin="0" end="0" resetval="0x0" description="Enable Reload Event in One Shot Mode   0: Writing of 0 will be ignored. Always reads back a 0.  1: Turns the one shot latch condition ON. Upon occurrence of a chosen load strobe, one shadow to active reload occurs and the latch will be cleared. Hence writing 1 to this bit would allow one load strobe event to pass through and block further strobe events." range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G0_EPWM24_SWVDELVAL" acronym="CONTROLSS_G0_EPWM24_SWVDELVAL" offset="0xEE" width="16" description="Software Valley Mode Delay Register">
		<bitfield id="SWVDELVAL" width="16" begin="15" end="0" resetval="0x0" description="Software Valley Delay Value Register  This register can be optionally used define offset value for the hardware calculated delay HWDELAYVAL as defined in VCAPCTL[VDELAYDIV] bits." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM24_TZSEL" acronym="CONTROLSS_G0_EPWM24_TZSEL" offset="0x100" width="16" description="Trip Zone Select Register ">
		<bitfield id="DCBEVT1" width="1" begin="15" end="15" resetval="0x0" description="Digital Compare Output B Event 1 Select   0: Disable DCBEVT1 as one-shot-trip source for this ePWM module.  1: Enable DCBEVT1 as one-shot-trip source for this ePWM module." range="15" rwaccess="R/W"/> 
		<bitfield id="DCAEVT1" width="1" begin="14" end="14" resetval="0x0" description="Digital Compare Output A Event 1 Select   0: Disable DCAEVT1 as one-shot-trip source for this ePWM module.  1: Enable DCAEVT1 as one-shot-trip source for this ePWM module." range="14" rwaccess="R/W"/> 
		<bitfield id="OSHT6" width="1" begin="13" end="13" resetval="0x0" description="Trip-zone 6 [TZ6] Select   0: Disable TZ6 as a one-shot trip source for this ePWM module  1: Enable TZ6 as a one-shot trip source for this ePWM module" range="13" rwaccess="R/W"/> 
		<bitfield id="OSHT5" width="1" begin="12" end="12" resetval="0x0" description="Trip-zone 5 [TZ5] Select   0: Disable TZ5 as a one-shot trip source for this ePWM module  1: Enable TZ5 as a one-shot trip source for this ePWM module" range="12" rwaccess="R/W"/> 
		<bitfield id="OSHT4" width="1" begin="11" end="11" resetval="0x0" description="Trip-zone 4 [TZ4] Select   0: Disable TZ4 as a one-shot trip source for this ePWM module  1: Enable TZ4 as a one-shot trip source for this ePWM module" range="11" rwaccess="R/W"/> 
		<bitfield id="OSHT3" width="1" begin="10" end="10" resetval="0x0" description="Trip-zone 3 [TZ3] Select   0: Disable TZ3 as a one-shot trip source for this ePWM module  1: Enable TZ3 as a one-shot trip source for this ePWM module" range="10" rwaccess="R/W"/> 
		<bitfield id="OSHT2" width="1" begin="9" end="9" resetval="0x0" description="Trip-zone 2 [TZ2] Select   0: Disable TZ2 as a one-shot trip source for this ePWM module  1: Enable TZ2 as a one-shot trip source for this ePWM module" range="9" rwaccess="R/W"/> 
		<bitfield id="OSHT1" width="1" begin="8" end="8" resetval="0x0" description="Trip-zone 1 [TZ1] Select   0: Disable TZ1 as a one-shot trip source for this ePWM module  1: Enable TZ1 as a one-shot trip source for this ePWM module" range="8" rwaccess="R/W"/> 
		<bitfield id="DCBEVT2" width="1" begin="7" end="7" resetval="0x0" description="Digital Compare Output B Event 2 Select   0: Disable DCBEVT2 as a CBC trip source for this ePWM module  1: Enable DCBEVT2 as a CBC trip source for this ePWM module" range="7" rwaccess="R/W"/> 
		<bitfield id="DCAEVT2" width="1" begin="6" end="6" resetval="0x0" description="Digital Compare Output A Event 2 Select   0: Disable DCAEVT2 as a CBC trip source for this ePWM module  1: Enable DCAEVT2 as a CBC trip source for this ePWM module" range="6" rwaccess="R/W"/> 
		<bitfield id="CBC6" width="1" begin="5" end="5" resetval="0x0" description="Trip-zone 6 [TZ6] Select   0: Disable TZ6 as a CBC trip source for this ePWM module  1: Enable TZ6 as a CBC trip source for this ePWM module" range="5" rwaccess="R/W"/> 
		<bitfield id="CBC5" width="1" begin="4" end="4" resetval="0x0" description="Trip-zone 5 [TZ5] Select   0: Disable TZ5 as a CBC trip source for this ePWM module  1: Enable TZ5 as a CBC trip source for this ePWM module" range="4" rwaccess="R/W"/> 
		<bitfield id="CBC4" width="1" begin="3" end="3" resetval="0x0" description="Trip-zone 4 [TZ4] Select   0: Disable TZ4 as a CBC trip source for this ePWM module  1: Enable TZ4 as a CBC trip source for this ePWM module" range="3" rwaccess="R/W"/> 
		<bitfield id="CBC3" width="1" begin="2" end="2" resetval="0x0" description="Trip-zone 3 [TZ3] Select   0: Disable TZ3 as a CBC trip source for this ePWM module  1: Enable TZ3 as a CBC trip source for this ePWM module" range="2" rwaccess="R/W"/> 
		<bitfield id="CBC2" width="1" begin="1" end="1" resetval="0x0" description="Trip-zone 2 [TZ2] Select   0: Disable TZ2 as a CBC trip source for this ePWM module  1: Enable TZ2 as a CBC trip source for this ePWM module" range="1" rwaccess="R/W"/> 
		<bitfield id="CBC1" width="1" begin="0" end="0" resetval="0x0" description="Trip-zone 1 [TZ1] Select   0: Disable TZ1 as a CBC trip source for this ePWM module  1: Enable TZ1 as a CBC trip source for this ePWM module" range="0" rwaccess="R/W"/>
	</register>
